InformationRegisters/ВходящиеПлатежныеСсылкиСБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВходящиеПлатежныеСсылкиСБП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаПройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ВводВходящейПлатежнойСсылкиСБП/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Документ = Параметры.Документ;
	ПлатежнаяСсылка = Параметры.ПлатежнаяСсылка;
	ИсходнаяПлатежнаяСсылка = Параметры.ПлатежнаяСсылка;
	НастройкаПодключения = Параметры.НастройкаПодключения;
	Контрагент = Параметры.Контрагент;
	БанковскийСчетКонтрагента = Параметры.БанковскийСчетКонтрагента;
	
	ЭтоПлатежныйДокумент = ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств");
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИНН");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		НомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКонтрагента, "НомерСчета");
	КонецЕсли;
	
	ДанныеНастройки = СистемаБыстрыхПлатежейУТ.ДанныеНастройкиПодключения(НастройкаПодключения);
	
	Организация = ДанныеНастройки.Организация;
	БанковскийСчетОрганизации = ДанныеНастройки.БанковскийСчет;
	
	Если ЭтоПлатежныйДокумент Тогда
		
		Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Статус");
		КОплате = Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
		
	КонецЕсли;
	
	ПоказатьКартинку();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежнаяСсылкаПриИзменении(Элемент)
	
	ПлатежнаяСсылкаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		
		Если КОплате Тогда
			Закрыть(Неопределено);
			Возврат;
		КонецЕсли;
		
		Если ИсходнаяПлатежнаяСсылка = ПлатежнаяСсылка Тогда
			Закрыть(Неопределено);
			Возврат;
		КонецЕсли;
		
		ОповещениеОПолученииДанныхЗаполнения = Новый ОписаниеОповещения("ПроверитьПлатежнуюСсылку", ЭтотОбъект);
		СистемаБыстрыхПлатежейУТКлиент.ПолучитьДанныеЗаполненияПоПлатежнойСсылке(
			ЭтотОбъект, НастройкаПодключения, ПлатежнаяСсылка, ОповещениеОПолученииДанныхЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()

	Заголовок = ?(КОплате, НСтр("ru = 'QR-код'"), НСтр("ru = 'Ввод платежной ссылки'"));
	Элементы.АдресКартинки.Видимость = КОплате;
	Элементы.ПлатежнаяСсылка.ТолькоПросмотр = КОплате;

КонецПроцедуры

&НаСервере
Процедура ПлатежнаяСсылкаПриИзмененииНаСервере()

	ПоказатьКартинку();
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ПоказатьКартинку()

	Если КОплате Тогда
		
		Элементы.ДекорацияПредупреждение.Заголовок = "";
		
		Если ЗначениеЗаполнено(ПлатежнаяСсылка) Тогда
			
			Результат = ПереводыСБПb2b.ДанныеФункциональнойСсылки(ПлатежнаяСсылка, НастройкаПодключения);
			ДвоичныеДанные = СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(ПлатежнаяСсылка, 150);
			АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			Если ЗначениеЗаполнено(Результат.КодОшибки) Тогда
				Элементы.ДекорацияПредупреждение.Заголовок = Результат.СообщениеОбОшибке;
			Иначе
				
				ДанныеСсылки = Результат.ДанныеСсылки;
				
				Если ДанныеСсылки.ИНН <> ИНН
					Или (ДанныеСсылки.СчетПолучателя <> НомерСчета
					И Не ПустаяСтрока(НомерСчета))Тогда
					Элементы.ДекорацияПредупреждение.Заголовок = 
						СтрШаблон(НСтр("ru = 'Реквизиты получателя платежа, указанные в платежной ссылке, не соответствуют данным получателя в документе.
										|Получатель платежа СБП: ИНН - %1 , счет - %2'"),
						ДанныеСсылки.ИНН,
						ДанныеСсылки.СчетПолучателя);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПлатежнуюСсылку(Результат, ДополнительныеПараметры) Экспорт

	ДанныеПлатежнойСсылки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Для Каждого Сообщение Из Результат.Сообщения Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение.Текст);
	КонецЦикла;
	
	Если ДанныеПлатежнойСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПлатежнойСсылки.КодОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеПлатежнойСсылки.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверки = ДенежныеСредстваКлиентСерверЛокализация.ПараметрыПроверкиПолучателяПлатежнойСсылки();
	ПараметрыПроверки.ИНН = ИНН;
	ПараметрыПроверки.НомерСчета = НомерСчета;
	
	Если Не ДенежныеСредстваКлиентСерверЛокализация.ПолучательПлатежнойСсылкиСоответствуетДокументу(ПараметрыПроверки, ДанныеПлатежнойСсылки) Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Реквизиты получателя платежа, указанные в платежной ссылке, не соответствуют данным получателя в документе.
						|Получатель платежа СБП: ИНН - %1 , счет - %2'"),
			ДанныеПлатежнойСсылки.ИНН,
			ДанныеПлатежнойСсылки.СчетПолучателя);
		ЗаголовокПредупреждения = НСтр("ru = 'Проверка данных получателя платежа'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , ЗаголовокПредупреждения);
		
	Иначе
		
		Если ЭтоПлатежныйДокумент Тогда
			Успешно = ПроверитьПлатежнуюСсылкуПлатежногоДокумента(ДанныеПлатежнойСсылки);
		Иначе
			Успешно = ЗаписьПлатежнойСсылки(ДанныеПлатежнойСсылки);
		КонецЕсли;
		
		Если Успешно Тогда
			Закрыть(ДанныеПлатежнойСсылки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаписьПлатежнойСсылки(ПараметрыЗаписи)

	Если ПараметрыЗаписи.ТипСсылки = "02" Тогда
		
		НаборЗаписей = РегистрыСведений.ВходящиеПлатежныеСсылкиСБП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПлатежнаяСсылка.Установить(ПлатежнаяСсылка);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Платежная ссылка уже привязана к документу %1'"), Запись.ДокументОперации);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РегистрыСведений.ВходящиеПлатежныеСсылкиСБП.ЗаписатьПлатежнуюСсылку(
		Документ, ПараметрыЗаписи);
	Возврат Истина;

КонецФункции

&НаСервере
Функция ПроверитьПлатежнуюСсылкуПлатежногоДокумента(ДанныеПлатежнойСсылки)

	Ошибка = Ложь;
	
	Если ДанныеПлатежнойСсылки.ТипСсылки = "02" Тогда
		ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ПроверитьИспользованиеПлатежнойСсылкиВЗаявках(Документ, ПлатежнаяСсылка, Ошибка);
	КонецЕсли;
	
	Возврат Не Ошибка;

КонецФункции

#КонецОбласти
